# Создать словарь, где ключи и значения числа
d = {1: 2, 10: 5, 7: 6, 2: 2, 4: 7, 3: 10}
c = {}
print(d)
# Посчитать сумму ключей, значений, всех абсолютно чисел
a = 0
for key in d.keys():
    a += int(key)
print(a)


# Вывести значения, где ключи - четные числа
d = {1: 2, 10: 5, 7: 6, 2: 2, 4: 7, 3: 10}
for key in d.keys():
    if key % 2 == 0:
        print(key)

# Вывести самый большой ключ
print(max(d.keys()))


# Вывести значение пары с самым маленьким ключем
d = {1: 2, 10: 5, 7: 6, 2: 2, 4: 7, 3: 10}
i = 0
for j in d.keys():
    i = min(d.keys())
print(f'{i}: {d[i]}')


# Удалить пару где ключ 3
a = d.pop(3)
print(d)


# Сгенерировать словарь:
# {1:5, 2:4, 3:3, 4:2, 5:1}
d = {a: 6 - a for a in range(1, 6)}
print(d)

# {1:5, 2:4, 3:0, 4:2, 5:1}
for i, j in d.items():
    if i == j:
        d[j] =0
print(d)


# Найти среднее значение всех ключей
j = 0
d = {a: 6 - a for a in range(1, 6)}
print(sum(d.keys())/len(d))

# Попробовать все методы множеств
s = {9, 33, 5}
s2 = {1, 8, 2}
print(s & s2)
print(s ^ s2)
print(s | s2)
print(s - s2)

# -------------------------------

# Добавить 5 элементов в список и удалить первый и последний элемент (удаление сделать 2 способами - функциями и slice)
e = [2, 70, 30, 25, 10]
e.extend((3, 1, 8, 9, 5))
print(e)
# -----------1 sposob
e.pop(0)
print(e)
e.pop()
print(e)
# -----------2 sposob
e = [2, 70, 30, 25, 10]
e = e[1:]
e = e[:len(e)-1]

print(e)

# создать список чисел от 10 до 20
e = [i for i in range(10, 20)]
print(e)


# сгенерировать список [1, 1, 1, 2, 2, 2 , 3, 3, 3]
e = [i for i in range(1, 4)]
e = e * 3
e = sorted(e)
print(e)


# сгенерировать список [1, 2, 1, 1, 2, 3 , 1, 2, 3]
e = [i for i in range(1, 4)]
a = [i for i in range(1, 4)]
a.pop(2)
a.insert(2, 1)
e = sorted(e)
e = e * 2
a += e
print(a)


# посчитать сумму чисел в списке
s = 0
for i in e:
    s += i
print(s)


# создать список списков вывести список количества 2 в каждом из списков
q = 0
d=[]
e = [[0, 5, 22], [2, 2, 2], [30, 2, 2]]
for i, val in enumerate(e):
    q = 0
    if 2 in val:
        q = val.count(2)
    d += [q]
print(d)


# создать список списков вывести список индексов списков где нет 2
e = [[0, 5, 22], [2, 2, 2], [30, 2, 2], [1, 6, 10]]

d = []
for i, val in enumerate(e):
    if 2 not in val:
        d += [i]
print(d)

# добавить элемент в tuple

a = (3, 28, 458)
b = 'jhkfxfgbv'
a = list(a)
a.append(b)
c = tuple(a)
print(c)
